In [60]:
import pandas as pd

In [61]:
df = pd.read_csv("../Data/pandas_practice_data.csv")

In [62]:
df

   EmployeeID   Name   Age Department   Salary    City
0         101   Amit  23.0         HR  25000.0   Delhi
1         102   Riya  29.0         IT  45000.0  Mumbai
2         103   John  35.0         IT  60000.0   Delhi
3         104   Neha   NaN    Finance  52000.0    Pune
4         105  Karan  41.0         HR      NaN  Mumbai
5         106   Sara  28.0    Finance  48000.0   Delhi
6         107  Vikas   NaN         IT  70000.0    Pune
7         108  Anita  32.0         HR      NaN  Mumbai

In [63]:
#1. Select a single column
df["Age"]

0    23.0
1    29.0
2    35.0
3     NaN
4    41.0
5    28.0
6     NaN
7    32.0
Name: Age, dtype: float64

In [64]:
#2. Select multiple columns.
df[["Name", "Age", "City"]]

    Name   Age    City
0   Amit  23.0   Delhi
1   Riya  29.0  Mumbai
2   John  35.0   Delhi
3   Neha   NaN    Pune
4  Karan  41.0  Mumbai
5   Sara  28.0   Delhi
6  Vikas   NaN    Pune
7  Anita  32.0  Mumbai

In [65]:
#3. Select rows using: .loc  .iloc

df.loc[0:2, "Age"]

0    23.0
1    29.0
2    35.0
Name: Age, dtype: float64

In [66]:
df.iloc[0:2]

   EmployeeID  Name   Age Department   Salary    City
0         101  Amit  23.0         HR  25000.0   Delhi
1         102  Riya  29.0         IT  45000.0  Mumbai

In [67]:
#4. Filter rows where Age > 25.
df[df["Age"] > 25]

   EmployeeID   Name   Age Department   Salary    City
1         102   Riya  29.0         IT  45000.0  Mumbai
2         103   John  35.0         IT  60000.0   Delhi
4         105  Karan  41.0         HR      NaN  Mumbai
5         106   Sara  28.0    Finance  48000.0   Delhi
7         108  Anita  32.0         HR      NaN  Mumbai

In [68]:
#5. Filter rows where salary is between 30000 and 60000.
df[(df["Salary"] > 30000) & (df["Salary"] < 60000)]

   EmployeeID  Name   Age Department   Salary    City
1         102  Riya  29.0         IT  45000.0  Mumbai
3         104  Neha   NaN    Finance  52000.0    Pune
5         106  Sara  28.0    Finance  48000.0   Delhi

In [69]:
#6. Select rows with multiple conditions.
df[(df["Age"] > 25) & (df["City"] == "Delhi")]

   EmployeeID  Name   Age Department   Salary   City
2         103  John  35.0         IT  60000.0  Delhi
5         106  Sara  28.0    Finance  48000.0  Delhi

In [70]:
#7. Check for null values in each column.
df.isnull()

   EmployeeID   Name    Age  Department  Salary   City
0       False  False  False       False   False  False
1       False  False  False       False   False  False
2       False  False  False       False   False  False
3       False  False   True       False   False  False
4       False  False  False       False    True  False
5       False  False  False       False   False  False
6       False  False   True       False   False  False
7       False  False  False       False    True  False

In [71]:
#8. Count total missing values.
df.isnull().sum()

EmployeeID    0
Name          0
Age           2
Department    0
Salary        2
City          0
dtype: int64

In [72]:
#9. Drop rows with missing values.
df.dropna()

   EmployeeID  Name   Age Department   Salary    City
0         101  Amit  23.0         HR  25000.0   Delhi
1         102  Riya  29.0         IT  45000.0  Mumbai
2         103  John  35.0         IT  60000.0   Delhi
5         106  Sara  28.0    Finance  48000.0   Delhi

In [73]:
df["Age"].fillna(df["Age"].median())

0    23.0
1    29.0
2    35.0
3    30.5
4    41.0
5    28.0
6    30.5
7    32.0
Name: Age, dtype: float64

In [74]:
df["Age"].fillna(0)

0    23.0
1    29.0
2    35.0
3     0.0
4    41.0
5    28.0
6     0.0
7    32.0
Name: Age, dtype: float64

In [75]:
#10. Fill missing values with: mean   median  a fixed value
df["Age"].fillna(df["Age"].mean(), inplace = True)

In [76]:
df

   EmployeeID   Name        Age Department   Salary    City
0         101   Amit  23.000000         HR  25000.0   Delhi
1         102   Riya  29.000000         IT  45000.0  Mumbai
2         103   John  35.000000         IT  60000.0   Delhi
3         104   Neha  31.333333    Finance  52000.0    Pune
4         105  Karan  41.000000         HR      NaN  Mumbai
5         106   Sara  28.000000    Finance  48000.0   Delhi
6         107  Vikas  31.333333         IT  70000.0    Pune
7         108  Anita  32.000000         HR      NaN  Mumbai

In [80]:
df["Salary"] = df["Salary"].fillna(df["Salary"].mean())

In [82]:
df

   EmployeeID   Name        Age Department   Salary    City
0         101   Amit  23.000000         HR  25000.0   Delhi
1         102   Riya  29.000000         IT  45000.0  Mumbai
2         103   John  35.000000         IT  60000.0   Delhi
3         104   Neha  31.333333    Finance  52000.0    Pune
4         105  Karan  41.000000         HR  50000.0  Mumbai
5         106   Sara  28.000000    Finance  48000.0   Delhi
6         107  Vikas  31.333333         IT  70000.0    Pune
7         108  Anita  32.000000         HR  50000.0  Mumbai

In [ ]:
#df.fillna({"Salary": df["Salary"].mean(), "Age" : df["Age"].mean()}, inplace=True)